{
    "bio": "Software engineer passionate about automation and building efficient, scalable systems. Dedicated to continuous learning and leveraging technology to drive meaningful impact. I thrive on solving complex challenges through thoughtful design and collaboration, always striving to create solutions that stand the test of time.",
    "experience": [
        {
            "company": "Church of Jesus Christ of Latter Day Saints",
            "position": "QA Engineer Intern",
            "start": "1 May 2020",
            "end": "1 Dec 2020",
            "duties": [],
            "achievments": [
                "Built an end-to-end Cypress testing suite, structured for easy extensibility, enabling a busy QA lead to gradually add tests. Replaced 40 hours of manual testing weekly, laying the foundation for scalable and reliable QA processes.",
                "Integrated tests with Jira for real-time reporting, visible to the whole team. The suite caught critical bugs in multiple releases, ensuring smoother deployments.",
                "Documented the automated test suite comprehensively, enabling seamless updates and ensuring future scalability of the QA framework."
            ]
        },
        {
            "company": "Anglepoint",
            "position": "Software Developer III",
            "start": "5 May 2021",
            "end": "",
            "duties": [],
            "achievments": [
                "Led development of a key product for our IBM department, integrating with client SAM tools to automate software installation data retrieval and classification. Streamlined licensing workflows to enhance accuracy and ensure enterprise compliance.",
                "Spearheaded migration of codebase from .NET Framework 4.8 to .NET 8 by identifying and decoupling incompatible libraries, adopting dependency inversion patterns, and performing extensive regression testing to ensure stable releases.",
                "Designed and implemented a .NET Framework backend solution to process large log file batches, automating millions of entries from zip uploads (30-100 files, up to 20MB each). Collaborated with the client to gather requirements and deliver the feature within 6 months of my tenure, streamlining log analysis and resolving Excel limitations.",
                "Enhanced deployment velocity from 2 deploys per month to 3 per week by designing an Azure DevOps CI/CD pipeline and integrating Launch Darkly feature flags, decreasing deployment risk and enabling faster feature rollouts.",
                "Migrated 350 production databases using Azure Database Migration Service, leveraging pre-migration backups and validated dry runs to ensure a smooth transition within a 2-hour planned downtime."
            ]
        }
    ],
    "skills": [
        "Azure",
        "C#",
        ".NET Framework",
        ".NET Core",
        "SQL Server",
        "Python",
        "JavaScript",
        "Angular",
        "HTML",
        "Java",
        "Cypress",
        "Jira",
        "Bash",
        "Github",
        "Elixir",
        "Postgres",
        "LaunchDarkly"
    ],
    "projects": [
        {
            "name": "Compiler",
            "highlights": [
                "Built a compiler in Python for a custom object-oriented programming language, translating high-level code into assembly instructions. Demonstrated proficiency in compiler design by implementing complex features like class handling, method calls, and pointers, strengthening theoretical knowledge of language processing."
            ]
        },
        {
            "name": "Assembler",
            "highlights": [
                "Designed and implemented a two-pass assembler in Python to convert assembly instructions into bytecode as part of a capstone project. Focused on opcode translation, symbol resolution, and instruction parsing, reinforcing concepts in low-level programming and system architecture."
            ]
        },
        {
            "name": "Virtual Machine",
            "highlights": [
                "Engineered a Virtual Machine in Python to execute bytecode generated by a custom assembler. Designed a stack-based execution model and optimized memory management to simulate a runtime environment, applying core computer science concepts in practice."
            ]
        },
        {
            "name": "Resume Website",
            "highlights": [
                "Created a static resume website using Svelte and Tailwind CSS to showcase projects and professional achievements. Deployed on Azure for ease of access, with automated deployment pipelines configured through GitHub Actions to streamline updates and ensure consistent delivery."
            ]
        }
    ],
    "certs": [
        {
            "giver": "Microsoft",
            "diploma": "Azure Associate Developer"
        },
        {
            "giver": "Microsoft",
            "diploma": "Azure Fundamentals"
        },
        {
            "giver": "Microsoft",
            "diploma": "Azure Machine Learning Fundamentals"
        },
        {
            "giver": "LaunchDarkly",
            "diploma": "LaunchDarkly Silver Certificate"
        }
    ],
    "degrees": [
        {
            "giver": "Utah Valley University",
            "diploma": "Bachelor of Science in Computer Science"
        }
    ],
    "references": [
        {
            "name": "James Bekker",
            "title": "Religous Mission Supervisor",
            "company": "University of Utah",
            "email": "James.Bekker@hsc.urah.edu"
        },
        {
            "name": "Bradley Clark",
            "title": "Engineering Manager",
            "company": "Anglepoint",
            "email": "bradley.clark@anglepoint.com"
        },
        {
            "name": "Viktorya Reznik",
            "title": "VP of Engineering",
            "company": "Anglepoint",
            "email": "viktory.reznik@anglepoint.com"
        }
    ]
}